#pragma once
#include <random>
#include "List.h"
#include "Node.h"
#define NUMBER_OF_Do 9
#define NUMBER_OF_Si 5
#define NUMBER_OF_UnderSi 7
#define NUMBER_OF_FIRSTNAME 23
#define NUMBER_OF_RESTNAME 32
#define lenofDo3 8
#define lenofDo4 10
#define lenofDo7 16
#define lenofSi 8
#define lenofUnderSi 13
#define lenofFirstName 3
#define lenofRestName 5
#define lenofNumbers 11

class List;

class Random
{
public :


	int RandomValue(int limit) const;

	char* RCN(void) const;//Randomly Create Name
	char* RCP(void) const;//Randomly Create Phone Number
	char* RCA(void) const;//Randomly Create Address


private :
	const char* Do[9] = { {"경기도 "}, {"강원도 "}, {"충청남도 "}, {"충청북도 "}, {"전라남도 "}, {"전라북도 "}, {"경상남도 "}, {"경상북도 "}, {"제주특별자치도 "} };

	const char* Si[NUMBER_OF_Do][NUMBER_OF_Si] = { { {"수원시 "}, {"성남시 "}, {"용인시 "}, {"안양시 "}, {"안산시 "} },
		{ {"춘천시 "}, {"원주시 "}, {"속초시 "}, {"홍천군 "}, {"평창군 "} },
		{ {"공주시 "}, {"아산시 "}, {"천안시 "}, {"논산시 "}, {"서산시 "} },
		{ {"괴산군 "}, {"제천시 "}, {"청주시 "}, {"영동군 "}, {"충주시 "} },
		{ {"나주시 "}, {"해남군 "}, {"보성군 "}, {"순천시 "}, {"남양군 "} },
		{ {"전주시 "}, {"군산시 "}, {"익산군 "}, {"남원시 "}, {"정읍군 "} },
		{ {"진주시 "}, {"창원시 "}, {"김해시 "}, {"거제시 "}, {"양산시 "} },
		{ {"포항시 "}, {"경주시 "}, {"김천시 "}, {"안동시 "}, {"구미시 "} },
		{ "\0","\0","\0","\0","\0" } };

	const char* UnderSi[NUMBER_OF_Do][NUMBER_OF_Si][NUMBER_OF_UnderSi] = {
		{//0
			{"파장동", "율천동", "정자동", "천천동", "송죽동", "조원동", "연무동"},//0
			{"신흥2동", "산성동", "금광1동", "하대원동", "상대원1동", "은행2동", "분당동"},//1
			{"중앙동", "양지면", "기흥동", "마북동", "동천동", "신봉동", "성복동"},//2
			{"안양1동", "안양2동", "안양3동", "비산1동", "비산2동", "비산3동", "부흥동"},//3
			{"사동", "일동", "이동", "부곡동", "안산동", "월피동", "성포동"} //4
},/////////////////////////////////////////////////////////
		{//1
			{"동면", "동산면", "신동면", "동내면", "남면", "남산면", "서면"},//0
			{"소초면", "호저면", "지정면", "부론면", "귀래면",	"흥업면판부면", "신림면"},//1
			{"영랑동","동명동","금호동", "교동", "노학동", "조양동", "청호동"},//2
			{"화촌면", "두촌면", "내촌면", "서석면", "동면", "남면", "서면"},//3
			{"미탄면", "방림면", "대화면", "봉평면", "용평면", "진부면", "대관령면"} //4
},//////////////////////////////////////////////////////////
		{//2
			{"이인면", "탄천면", "계룡면", "반포면", "의당면", "정안면", "우성면"},//0
			{"송악면", "탕정면", "음봉면", "둔포면", "영인면", "인주면", "선장면"},//1
			{"입장면", "풍세면", "광덕면", "북면", "성남면", "수신면", "병천면"},//2
			{"성동면", "광석면", "노성면", "상월면", "부적면", "연산면", "벌곡면"},//3
			{"인지면", "부석면", "팔봉면", "지곡면", "성연면", "음암면", "운산면"} //4
},//////////////////////////////////////////////////////////
		{//3
			{"감물면", "장연면", "연풍면", "칠성면", "문광면", "청천면", "청안면"},//0
			{"금성면", "청풍면", "수산면", "덕산면", "한수면", "백운면", "송학면"},//1
			{"낭성면", "미원면", "가덕면", "남일면", "문의면", "남이면", "현도면"},//2
			{"용산면", "황간면", "추풍령면", "매곡면", "상촌면", "양강면", "용화면"},//3
			{"살미면", "수안보면", "대소원면", "신니면", "노은면", "앙성면", "중앙탑면"} //4
},//////////////////////////////////////////////////////////
		{//4
			{"세지면", "왕곡면", "반남면", "공산면", "동강면", "다시면", "문평면"},//0
			{"삼산면", "화산면", "현산면", "송지면", "북평면", "북일면", "옥천면"},//1
			{"노동면", "미력면", "겸백면", "율어면", "복내면", "문덕면", "조성면"},//2
			{"주암면", "송광면", "외서면", "낙안면", "별량면", "상사면", "해룡면"},//3
			{"음덕리면", "화척지면", "둔지곶면", "분향리면", "쌍수리면", "마도면", "송산면"} //4
},//////////////////////////////////////////////////////////
		{//5
			{"중앙동", "충남동", "노송동", "완산동", "동서학동", "서서학동", "중화산1동"},//0
			{"옥산면", "회현면", "임피면", "서수면", "대야면", "개정면", "성산면"},//1
			{"익산면", "팔봉면", "북일면", "오산면", "춘포면", "금마면", "삼기면"},//2
			{"주천면", "수지면", "송동면", "주생면", "금지면", "대강면", "대산면"},//3
			{"북면", "입암면", "소성면", "고부면", "영원면", "덕천면", "이평면"} //4
},//////////////////////////////////////////////////////////
		{//6
			{"내동면", "정촌면", "금곡면", "진성면", "일반성면", "이반성면", "사봉면"},//0
			{"북면", "대산면", "구산면", "진동면", "진북면", "진전면", "내서면"},//1
			{"주촌면", "진례면", "한림면", "생림면", "상동면", "대동면", "진영읍"},//2
			{"거제면", "일운면", "동부면", "남부면", "둔덕면", "사등면", "연초면"},//3
			{"물금읍","동면","원동면","상북면","하북면","중앙동","양주동"} //4
},/////////////////////////////////////////////////////////
		{//7
			{"신광면","청하면","송라면","기계면","죽장면","기북면","흥해읍"},//0
			{"감포읍","안강읍","건천읍","외동읍","선도동","현곡면","성건동"},//1
			{"아포읍","대신동","대곡동","자산동","지좌동","율곡동","어모면"},//2
			{"용상동","옥동","송하동","강남동","태화동","명륜동","풍산읍"},//3
			{"형곡1동","형곡2동","선주원남동","도량동","산동면","고아읍","선산읍	"} //4
},/////////////////////////////////////////////////////////
		{//8
			{"\0","\0","\0","\0","\0","\0","\0"},//0
			{"\0","\0","\0","\0","\0","\0","\0"},//1
			{"\0","\0","\0","\0","\0","\0","\0"},//2
			{"\0","\0","\0","\0","\0","\0","\0"},//3
			{"\0","\0","\0","\0","\0","\0","\0"} //4
}/////////////////////////////////////////////////////////
	};

	const char* FirstName[NUMBER_OF_FIRSTNAME] = { "김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신", "권", "황", "안", "송", "원", "곽", "기", "우", "심" };
	const char* RestName[NUMBER_OF_RESTNAME] = { "혁팔", "팔식", "대척", "두창", "귀필", "광창", "춘계", "피살", "태랑", "원춘", "대협", "억두", "민준", "서연", "서윤", "지우", "하은", "지민", "채원"
	, "지유", "은서", "수아", "다은", "예은", "수빈", "서영", "대근", "연우", "예나", "예서", "유나", "예진"};
};

